Tekla Open API Reference for Tekla Structures 2025
ModelObjectSelector.Select Method
Overload List
Name | Description
Select(ArrayList)
 Selects a list of objects from the user interface.
Select(ArrayList, Boolean)
 Selects a list of objects from the user interface.
Top
See Also
Reference
ModelObjectSelector Class
Tekla.Structures.Model.UI Namespace